/**
 * @param { import("knex").Knex } knex
 * @returns { Promise<void> }
 */
exports.up = async function(knex) {
    await knex.schema.createTable('wheels', function(table) {
        table.increments('wheels_id').primary();
        table.string('description', 1000);
        table.string('type');
    });

    await knex('wheels').insert([
        // الأمومة الآمنة
        { description: 'من اهدافها خفض نسب الوفيات للامهات', type: 'الأمومة الآمنة' },
        { description: 'مدة فترة النفاس تتراوح ما بين 6 ايام لأسابيع', type: 'الأمومة الآمنة' },
        { description: 'امتى الام تبدأ تتحرك بعد الولادة', type: 'الأمومة الآمنة' },
        { description: 'من اهدافها خفض نسب التشوهات للاطفال', type: 'الأمومة الآمنة' },
        { description: 'من الفحوصات اللازمة لزاوج الاقارب (التلاسيميا وامراض الدم الوراثية)', type: 'الأمومة الآمنة' },
        { description: 'تعرف الام بتكتسب وزن اد ايه اثناء الحمل', type: 'الأمومة الآمنة' },
        { description: 'ايه هو الوزن المثالي للطفل عند الولادة', type: 'الأمومة الآمنة' },
        { description: 'من الفحوصات اللازمة للرجال فصيلة الدم وعامل ريسيس وفحص السائل المنوي', type: 'الأمومة الآمنة' },
        { description: 'من حالات الحمل الخطرمنذ البداية الحمل بعد ولادة قيصرية في فترة اقل من سنتين وعدم توافق عامل ريسيس والحمل قبل سن 18 والحمل للمرة الخامسة', type: 'الأمومة الآمنة' },
        { description: 'ازاي نعتني بالمرأة الحامل', type: 'الأمومة الآمنة' },
        { description: 'اهمية الرضاعة الطبيعية بالنسبة للام (تقوي الرابط بين الام والطفل-وسيلة طبيعية -الحماية من سرطان الثدي)', type: 'الأمومة الآمنة' },
        { description: 'من علامات الخطورة اثناء الحمل (اكتفي بتلاتة)', type: 'الأمومة الآمنة' },
        { description: 'اقل عدد زيارات للحمل كام مرة', type: 'الأمومة الآمنة' },
        { description: 'جدول الزيارات في حالة الحمل الخطر مرة كل اسبوعين من اول 6 شهور ومرة كل اسبوع من السادس وحتى الولادة', type: 'الأمومة الآمنة' },
        { description: 'ايه هو دور الرجل في مرحلة الحمل', type: 'الأمومة الآمنة' },
        { description: 'اهمية الرضاعة بالنسة للطفل (الحصول على العناصر الغذائية -لبن الام في الشتاء يكون دافئ وفي الصيف يكون بارد)', type: 'الأمومة الآمنة' },
        { description: 'علامات الخطر اثناء الولادة (نزول كمية كبيرة من الدم-انفجار جيب المياه وعدم حدوث ولادة لمدة 12 ساعة-تدلي الحبل السري قبل خروج الجنين-ان تكون مدة الولادة اكثر من 10 ساعات-خروج الطفل بغير رأسه)', type: 'الأمومة الآمنة' },
        { description: 'ايه هما انواع الولادة', type: 'الأمومة الآمنة' },
        { description: 'علامات الخطورة اثناء النفاس (ارتفاع درجة الحرارة-نزيف مهبلي شديد-الام شديدة في البطن-الام وتورم الثديين)', type: 'الأمومة الآمنة' },
        { description: 'اقل عدد زيارات لفترة النفاس كام زيارة', type: 'الأمومة الآمنة' },
        { description: 'امتى الطفل يبدأ الرضاعة الطبيعية', type: 'الأمومة الآمنة' },
        { description: 'التطعيمات الي بياخدها الطفل (السل والحصبة-شلل الاطفال-الالتهاب الكبدي الوبائي-الثلاثي والسعال الديكي)', type: 'الأمومة الآمنة' },

        // أسئلة للأم
        { description: 'هل شربتِ ما يكفي من الماء اليوم؟', type: 'أسئلة للأم' },
        { description: 'هل قمتِ بممارسة تمارين الحمل اليوم؟', type: 'أسئلة للأم' },
        { description: 'هل تذكرين موعد زيارتك القادمة للطبيب؟', type: 'أسئلة للأم' },
        { description: 'هل لديكِ أي استفسارات حول الأعراض التي تشعرين بها؟', type: 'أسئلة للأم' },
        { description: 'هل قمتي بقراءة كتاب أو مقال عن التحضير للولادة؟', type: 'أسئلة للأم' },
        { description: 'هل تودين استماع لموسيقى مهدئة؟', type: 'أسئلة للأم' },
        { description: 'هل تذكرين أن تقومي بتمرين التنفس العميق اليوم؟', type: 'أسئلة للأم' },
        { description: 'هل أنتِ مستعدة للاستمتاع بلحظات هادئة مع نفسك في هذا الأسبوع؟', type: 'أسئلة للأم' },

        // معلومات عامة للأم والطفل
        { description: 'حمض الفوليك مهم لتقليل العيوب الخلقية للجنين.', type: 'معلومات عامة للأم والطفل' },
        { description: 'زيادة حجم الدم بنسبة 50% خلال الحمل لدعم الجنين.', type: 'معلومات عامة للأم والطفل' },
        { description: 'زيادة الوزن الطبيعية تتراوح بين 10-16 كيلوغرامًا.', type: 'معلومات عامة للأم والطفل' },
        { description: 'الهرمونات مثل البروجسترون والإستروجين تتغير وتؤثر على الجسم.', type: 'معلومات عامة للأم والطفل' },
        { description: 'الجنين يبدأ في التحرك بحلول الأسبوع 20.', type: 'معلومات عامة للأم والطفل' },
        { description: 'حضور دروس تحضيرية للولادة يساعد في التخفيف من الألم.', type: 'معلومات عامة للأم والطفل' },
        { description: 'المشي واليوغا يمكن أن يساعدان في تحسين الصحة العامة.', type: 'معلومات عامة للأم والطفل' },
        { description: 'زيارة الطبيب بانتظام لمتابعة نمو الجنين وصحة الأم.', type: 'معلومات عامة للأم والطفل' },

        // الخرافات والحقائق
        { description: 'ولادة المرأة بطفل مبكرًا يعني أن كل ولادة لها ستصبح مبكرة', type: 'الخرافات والحقائق' },
        { description: 'الاطفال الخدج أقل ذكاء من أقرانهم', type: 'الخرافات والحقائق' },
        { description: 'الأطفال الخدج لا يعيشوا حياة طبيعية', type: 'الخرافات والحقائق' },
        { description: 'اخذ اللقاح للطفل الخديج ضروري جدًا', type: 'الخرافات والحقائق' },
        { description: 'التغذية الصحية تقلل من خطورة إنجاب الطفل مبكرًا', type: 'الخرافات والحقائق' },

        // أسئلة مفيدة عن الطفل خلال 1-3 سنوات
        { description: 'هل قمتِ بممارسة تمارين الحمل اليوم؟', type: 'أسئلة مفيدة عن الطفل خلال 1-3 سنوات' },
        { description: 'هل تذكرين موعد زيارتك القادمة للطبيب؟', type: 'أسئلة مفيدة عن الطفل خلال 1-3 سنوات' },
        { description: 'هل لديكِ أي استفسارات حول الأعراض التي تشعرين بها؟', type: 'أسئلة مفيدة عن الطفل خلال 1-3 سنوات' },
        { description: 'هل قمتي بقراءة كتاب أو مقال عن التحضير للولادة؟', type: 'أسئلة مفيدة عن الطفل خلال 1-3 سنوات' },
        { description: 'هل تودين استماع لموسيقى مهدئة؟', type: 'أسئلة مفيدة عن الطفل خلال 1-3 سنوات' },
        { description: 'هل أنتِ مستعدة للاستمتاع بلحظات هادئة مع نفسك في هذا الأسبوع؟', type: 'أسئلة مفيدة عن الطفل خلال 1-3 سنوات' },
    ]);
};

/**
 * @param { import("knex").Knex } knex
 * @returns { Promise<void> }
 */
exports.down = function(knex) {
    return knex.schema.dropTableIfExists('wheels');
};
